DataProcessors/ИмпортСтатусаЗаказаПоставщикаИзAvarda.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортСтатусаЗаказаПоставщикаИзAvarda</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИсторияХраненияИзмененийЗагружСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияХраненияИзмененийЗагружСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоAvarda</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКорЗаказаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДопКорЗаказаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОстатокПоСкладу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗаказаПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаЗаказаПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаПоступленияНаСкладФилиала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОшибкиЗагрузкиДанныхИзАварды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЗагрузкиДанныхИзАварды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МоментОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПриоритетыОтправкиЭкспрессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПриоритетыОтправкиЭкспрессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УТ11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УТ10</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МТ_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МТ_ПредопределенныеЗначения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИмпортСтатусаЗаказаПоставщикаИзAvarda/Ext/ObjectModule.bsl
Перем СписокОтмененыхЗаказовПоставщика;
Перем КорректировкаЗаказаПоставщика, КорректировкаЗаказаПокупателя;

Процедура ИмпортСтатусовЗаказаПоставщикуИзAVARDA(ДатаНачала, ДатаКонец) Экспорт 

	ЗАпросИсключаемыхИзЭкспрессаСкладов = Новый Запрос;
	ЗАпросИсключаемыхИзЭкспрессаСкладов.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобственныеСклады.Ссылка КАК Склад,
	|	СобственныеСклады.ВэбСервисУТ11
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ (ВЫРАЗИТЬ(СобственныеСклады.АдресВебСервиса КАК СТРОКА(256))) = """"
	|	И НЕ СобственныеСклады.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СобственныеСклады.Идентификатор";
	
	РезультатЗапросаИсключаемыхИзЭкспрессаСкладов = ЗАпросИсключаемыхИзЭкспрессаСкладов.Выполнить();
	
	Если НЕ РезультатЗапросаИсключаемыхИзЭкспрессаСкладов.Пустой() Тогда
		
		ВыборкаСкладов = РезультатЗапросаИсключаемыхИзЭкспрессаСкладов.Выбрать();
		
		Пока ВыборкаСкладов.Следующий() Цикл
			ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, ВыборкаСкладов.ВэбСервисУТ11, "", ВыборкаСкладов.Склад);
		КонецЦикла;		
		
	КонецЕсли;

	Если Константы.ОтправлятьЗаказыВСтророннююУТ.Получить() Тогда
		
		ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец);

		Если Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() Тогда
			ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Ложь, "ПополнениеОП");
		КонецЕсли;

	КонецЕсли;	
	
	Если Константы.ОтправлятьЗаказыВСтророннююУТ11.Получить() Тогда
		ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Истина);		
	КонецЕсли;	
	
	Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() И НЕ Константы.ОтправлятьЗаказыНаГорючиеЖидкостиВУТ11.Получить() Тогда
		ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Ложь, "ГорючиеЖидкости");                                                        
	КонецЕсли;
	
	Если Константы.ОтправлятьЭкспрессыВ.Получить() Тогда
		
		Если Константы.ПриоритетОтправкиЭкспрессов.Получить() = Перечисления.ПриоритетыОтправкиЭкспрессов.УТ10 Тогда
			ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Ложь, "Экспрессы");
		ИначеЕсли Константы.ПриоритетОтправкиЭкспрессов.Получить() = Перечисления.ПриоритетыОтправкиЭкспрессов.УТ11 Тогда
			ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Истина, "Экспрессы");
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если Константы.ВыборочнаяОтправкаЗаказовСторСкладовВУТ11.Получить() Тогда
		ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, Истина, "СторонниеСклады");
	КонецЕсли;
	                                                    
	Сообщить("Данные загружены.");
	
КонецПроцедуры

Процедура ОбработатьСтатус120НетНаскладе(Знач СтатусТЗ, ОтмененныеСтрокиЗаказа = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т1.ЗаказПоставщика,
	|	Т1.Номенклатура,
	|	Т1.КодСтроки ,
	|   Т1.Статус
	|ПОМЕСТИТЬ СписокЗаказовПоставщика
	|ИЗ
	|	&СписокОтмененыхЗаказовПоставщика КАК Т1
	|   
	|ИНДЕКСИРОВАТЬ ПО
	|	Т1.ЗаказПоставщика,
	|	Т1.Номенклатура,
	|	Т1.КодСтроки	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Документ,
	|	Т1.Номенклатура,
	|	Т1.КодСтроки,
	|	СУММА(ВЫБОР
	|			КОГДА Т1.Статус = ""120; нет на складе""
	|				ТОГДА Т1.КоличествоAvarda
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОтменено_1,
	|	СУММА(ВЫБОР
	|			КОГДА Т1.Статус <> ""120; нет на складе""
	|				ТОГДА Т1.КоличествоAvarda
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОтменено_2,
	|	МАКСИМУМ(Т1.КоличествоОстатокПоСкладу) КАК КоличествоОстатокПоСкладу,
	|	МАКСИМУМ(Т1.КоличествоЗаказПоставщика) КАК КоличествоЗаказаПоставщика,
	|	МАКСИМУМ(Т1.КоличествоКорЗаказаПоставщика) КАК КоличествоКорЗаказаПоставщика,
	|	МАКСИМУМ(Т1.ЗаказПокупателя) КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК Т1
	|ГДЕ
	|	Т1.Статус В(&Статус)
	|	И Т1.Документ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т1.Документ,
	|	Т1.Номенклатура,
	|	Т1.КодСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т1.Документ,
	|	Т1.Номенклатура,
	|	Т1.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Документ КАК ЗП_ЗаказПоставщикуСсылка,
	|	ВТ.Номенклатура,
	|	ВТ.КодСтроки КАК ВТ_КодСтроки,
	|	МАКСИМУМ(ВТ.КоличествоОтменено_1) КАК КоличествоОтменено_1,
	|	МАКСИМУМ(ВТ.КоличествоОтменено_2) КАК КоличествоОтменено_2,
	|	МАКСИМУМ(ВТ.КоличествоОстатокПоСкладу) КАК КоличествоОстатокПоСкладу,
	|	МАКСИМУМ(ВТ.КоличествоЗаказаПоставщика) КАК КоличествоЗаказаПоставщика,
	|	МАКСИМУМ(ВТ.КоличествоКорЗаказаПоставщика) КАК КоличествоКорЗаказаПоставщика,
	|	МАКСИМУМ(ВТ.ЗаказПокупателя) КАК ЗП_Товары_ЗаказПокупателя,
	|	СУММА(ЕСТЬNULL(Т1.КоличествоAvarda, 0)) КАК КоличествоЗаказаноAvarda
	|ИЗ
	|	СписокЗаказовПоставщика КАК СписокЗаказовПоставщика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК Т1
	|			ПО ВТ.Документ = Т1.Документ
	|				И ВТ.Номенклатура = Т1.Номенклатура
	|				И ВТ.КодСтроки = Т1.КодСтроки
	|				И (НЕ Т1.Статус В (&Статус2))
	|		ПО СписокЗаказовПоставщика.ЗаказПоставщика = ВТ.Документ
	|			И СписокЗаказовПоставщика.Номенклатура = ВТ.Номенклатура
	|			И СписокЗаказовПоставщика.КодСтроки = ВТ.КодСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Документ,
	|	ВТ.Номенклатура,
	|	ВТ.КодСтроки";
	
	//Поле КоличествоЗаказаноAvarda определяет суммароное количество у которых статус не отменено.
	ОтмененныеСтрокиЗаказа = ?(ОтмененныеСтрокиЗаказа = Неопределено, СписокОтмененыхЗаказовПоставщика, ОтмененныеСтрокиЗаказа); 
	Запрос.УстановитьПараметр("СписокОтмененыхЗаказовПоставщика", ОтмененныеСтрокиЗаказа);	
	МассивЗначений = СтатусТЗ.ВыгрузитьКолонку("Имя");
	Запрос.УстановитьПараметр("Статус", МассивЗначений );
	Запрос.УстановитьПараметр("ДатаЗагрузки", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Статус2", МассивЗначений );
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	ОписаниеДокумента = "";
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ОписаниеДокумента) Тогда
			
			ОшибкаЗагрузки("", "Невозможно создать документы. " + ОписаниеДокумента);
			ОписаниеДокумента = "";
			
		КонецЕсли; 
		
		КорректировкаЗаказаПоставщика = Документы.КорректировкаЗаказаПоставщику.ПустаяСсылка();
		КорректировкаЗаказаПокупателя = Документы.КорректировкаЗаказаПокупателя.ПустаяСсылка();
		                                                              
		Если РезультатЗапроса.КоличествоОстатокПоСкладу = 0 Тогда
			Продолжить;
		КонецЕсли; 				
		
		Если РезультатЗапроса.КоличествоОтменено_1 = 0 Тогда 
			
			КоличествоКорректировки = РезультатЗапроса.КоличествоЗаказаПоставщика 									 
									 - РезультатЗапроса.КоличествоЗаказаноAvarda
									 - РезультатЗапроса.КоличествоКорЗаказаПоставщика;												 			
		КонецЕсли; 			
		
		Если КоличествоКорректировки > 0  Тогда
			
			МассивОшибок = Новый Массив;
			МассивОшибок.Добавить( "Заказ поставщику: " + РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка.Номер + " "  + Строка(РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка.Дата ) + " ; ");
			МассивОшибок.Добавить( "Номенклатура: " + РезультатЗапроса.Номенклатура.Код + " " + РезультатЗапроса.Номенклатура.Наименование + " ; ");
			МассивОшибок.Добавить( "Код строки:" + РезультатЗапроса.ВТ_КодСтроки + " ; ");
			МассивОшибок.Добавить( "Статус: 120; нет на складе");
			//////////////////////////////////////////////////////////////////
			МенеджерЗаписи = РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Документ = РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка;
			МенеджерЗаписи.Номенклатура = РезультатЗапроса.Номенклатура;
			МенеджерЗаписи.КодСтроки =  РезультатЗапроса.ВТ_КодСтроки;
			МенеджерЗаписи.Статус =  "120; нет на складе";	
			
			МенеджерЗаписи.Прочитать();				
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.КорректировкаЗаказаПоставщика = КорректировкаЗаказаПоставщика;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли; 
			///////////////////////////////////////////////////
				
			Попытка				
				//НачатьТранзакцию();
				СоздатьКорректировкуЗаказаПоставщика(РезультатЗапроса, КоличествоКорректировки);												
				//ЗафиксироватьТранзакцию();
				
				МенеджерЗаписи.КорректировкаЗаказаПокупателя = КорректировкаЗаказаПокупателя;
				МенеджерЗаписи.КорректировкаЗаказаПоставщика = КорректировкаЗаказаПоставщика;
				МенеджерЗаписи.КоличествоДопКорЗаказаПоставщика = КоличествоКорректировки;
								
				МенеджерЗаписи.Записать(Истина);
				
			Исключение
				
				//ОтменитьТранзакцию();				
				ОписаниеДокумента = ОписаниеОшибкиОбработкиДанных(МассивОшибок);
				Ошибка = ИнформацияОбОшибке();
				ОписаниеДокумента = ОписаниеДокумента + "; " + Ошибка.Причина.Описание; 
				
				Продолжить;								
				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры	

Процедура СоздатьКорректировкуЗаказаПоставщика(СтрокаРезультатаЗапроса, КоличествоКорректировки)	
	
	КорректЗаказаПоставщику = Документы.КорректировкаЗаказаПоставщику.СоздатьДокумент();	
	ЗаказПоставщика = СтрокаРезультатаЗапроса.ЗП_ЗаказПоставщикуСсылка.ПолучитьОбъект();	
	
	ЗаказПоставщикаТоварыСтрока = ЗаказПоставщика.Товары.Найти( СтрокаРезультатаЗапроса.ВТ_КодСтроки, "УИД");
	
	КорректЗаказаПоставщику.Заполнить( СтрокаРезультатаЗапроса.ЗП_ЗаказПоставщикуСсылка );
	КорректЗаказаПоставщику.Дата = ТекущаяДата();
	
	ТабЧастьТовары = КорректЗаказаПоставщику.Товары;                                      
	ТабЧастьТовары.Очистить();
	
	НоваяСтрока = ТабЧастьТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗаказПоставщикаТоварыСтрока); 
	
	НоваяСтрока.Количество = -1 * КоличествоКорректировки;
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);

	НоваяСтрока.Заказ = СтрокаРезультатаЗапроса.ЗП_Товары_ЗаказПокупателя;
	КорректЗаказаПоставщику.Комментарий = "Документ создан автоматич. обработкой ""ИмпортСтатусаЗаказаПоставщикаИзАварда"" ";

	КорректЗаказаПоставщику.Записать( РежимЗаписиДокумента.Проведение );
	
	Если ЗначениеЗаполнено(СтрокаРезультатаЗапроса.ЗП_Товары_ЗаказПокупателя) Тогда
		СоздатьКорректировкуЗаказаПокупателя( КорректЗаказаПоставщику.Товары[0], СтрокаРезультатаЗапроса.ЗП_Товары_ЗаказПокупателя, Истина);			
	КонецЕсли; 
	
	КорректировкаЗаказаПоставщика = КорректЗаказаПоставщику.Ссылка;
	
КонецПроцедуры
 
Процедура СоздатьКорректировкуЗаказаПокупателя(СтрокаТовары, ЗаказПокупателяСсылка, Проведение ) 
	
	НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ЗаказПокупателя = ЗаказПокупателяСсылка;
	НовыйДок.Заполнить(ЗаказПокупателяСсылка);
	
	ТабЧастьТовары = НовыйДок.Товары;
	ТабЧастьТовары.Очистить();
	
	НоваяСтрока = ТабЧастьТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары); 
	
	// Получаем среднюю цену закупки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Цена) КАК СуммаПодсчит,
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ЗаказПокупателяТовары.ТолькоРезерв) КАК ТолькоРезерв
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Ссылка
	|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателяСсылка);
	Запрос.УстановитьПараметр("Номенклатура", НоваяСтрока.Номенклатура);	
	                                            
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЦенаЗакупкиЗаЕдиницу = Окр(ВыборкаЗапроса.СуммаПодсчит / ВыборкаЗапроса.Количество, 2, 1); 
		НоваяСтрока.ТолькоРезерв = ВыборкаЗапроса.ТолькоРезерв;
		
	КонецЦикла;	 			
	
	НоваяСтрока.Цена = ЦенаЗакупкиЗаЕдиницу;
	
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, НовыйДок);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДок);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДок);
	
	НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПоставщика;
	НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
	
	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	
	КорректировкаЗаказаПокупателя = НовыйДок.Ссылка;

КонецПроцедуры

Функция СписокОтмененыхСтатусов() Экспорт 
	
	СтатусТЗ = Новый ТаблицаЗначений;
	СтатусТЗ.Колонки.Добавить("Имя");
	
	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "5; удален";

	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "100; отказ клиента";

	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "110; недостача при сборке";
	
	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "120; нет на складе";
	
	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "120; не отгружено";
	
	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "130; аннулирован";
	
	СтрокаТЗ = СтатусТЗ.Добавить();
	СтрокаТЗ.Имя = "340; отказ поставщика";
	
	Возврат СтатусТЗ;

КонецФункции
 
Функция Соединение(Подключение) Экспорт 
	
	#Если Клиент Тогда
		Стр = "Provider=MSDASQL;Password=54321;Persist Security Info=True;User ID=TWUSER;Data Source=" + ПолучитьИмяАварды() + "32;Initial Catalog=" + ПолучитьИмяАварды() + "32";
	#ИначеЕсли Сервер Тогда
		Стр = "Provider=MSDASQL;Password=54321;Persist Security Info=True;User ID=TWUSER;Data Source=" + ПолучитьИмяАварды() + ";Initial Catalog=" + ПолучитьИмяАварды();
	#КонецЕсли 
	
	Попытка		
		
		Подключение.ConnectionTimeout = 30;
		Подключение.Open(Стр);                                                    
		Возврат Истина;
		
	Исключение
		
		#Если Клиент Тогда
			глОшибкаАДО("Ошибка подключения ...", Подключение);
		#КонецЕсли
		Возврат Ложь;
		
	КонецПопытки; 	

КонецФункции

Функция СформироватьЗапрос(СтрокаЗапроса,Подключение) Экспорт
	
	Попытка               
		
		Код = Новый ComObject("ADODB.Recordset");   
		Код.Open(СтрокаЗапроса,Подключение, 2, 3, 1);	
		Возврат Код;
		
	Исключение
		
		глОшибкаАДО("", Подключение); 
		Возврат Неопределено;
		
	КонецПопытки;	

КонецФункции

Процедура глОшибкаАДО(стрФункция = "", Подключение) Экспорт 
	
	Если Подключение.Errors.Count() <> 0 Тогда
		
		Для Ин = 0 По Подключение.Errors.Count() - 1 Цикл
			
			чКод = Подключение.Errors(Ин).Number();
			сОписание = Подключение.Errors(Ин).Description();
			сИсточник = Подключение.Errors(Ин).Source();
			Сообщить("ADO Error: " + чКод + " | " + стрФункция + " | " + сОписание + " | " + Подключение.Errors.Item);
			
		КонецЦикла;
		
		Подключение.Errors.Clear();
		
	Иначе
		Сообщить("Ошибка: " + ОписаниеОшибки());
	КонецЕсли;	

КонецПроцедуры 

Функция ПолучитьИмяАварды() Экспорт 
	
	Рез = Константы.ИмяБазыАварда.Получить();
	
	Если Не ЗначениеЗаполнено(Рез) тогда
		Рез = "AVARDA";
	КонецЕсли;
	Возврат Рез;

КонецФункции

Функция ПолучитьДату(Дата) Экспорт
	
	Возврат Формат(Дата, "ДЛФ=Д");

КонецФункции

Процедура ОшибкаЗагрузки(ТекстОшибки, ОписаниеОшибки)
		
	ЗаписьЖурналаРегистрации("Импорт статусов заказов поставщика из Avarda", УровеньЖурналаРегистрации.Ошибка, , ,
	ТекстОшибки + ":" + ОписаниеОшибки); 		
	
	МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзАварды.СоздатьМенеджерЗаписи();
	МЗ.МоментОшибки = ТекущаяДата();
	МЗ.ТекстОшибки = ТекстОшибки;
	МЗ.ОписаниеОшибки = ОписаниеОшибки;
	МЗ.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСписокОтмененыхЗаказовПоставщика(РезультатЗапроса, Статус)
	
	НоваяСтрока = СписокОтмененыхЗаказовПоставщика.Добавить();
	НоваяСтрока.ЗаказПоставщика = РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка;
	НоваяСтрока.Номенклатура = РезультатЗапроса.ЗП_Товары_Номенклатура;
	НоваяСтрока.КодСтроки 	= РезультатЗапроса.ВТ_КодСтроки;
	НоваяСтрока.Статус = Статус;

КонецПроцедуры
 
Функция ОписаниеОшибкиОбработкиДанных(МассивОшибок)
	
	ОписаниеДокумента = МассивОшибок[0] + МассивОшибок[1] + МассивОшибок[2] + МассивОшибок[3];
	Возврат ОписаниеДокумента;

КонецФункции

Процедура ПолучитьСтатусыИзСтороннейБазы(ДатаНачала, ДатаКонец, УТ11 = Ложь, ВидОперации = "", Склад = Неопределено) Экспорт 

	ОписаниеТиповСтрока = новый ОписаниеТипов("Строка", новый КвалификаторыСтроки(80, ДопустимаяДлина.Переменная));
	ОписаниеТиповДата = новый ОписаниеТипов("Дата", новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ОписаниеТиповЧисло = новый ОписаниеТипов("Число", новый Квалификаторычисла(12));
	ОписаниеТиповЗаказПоставщика = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику");		
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОписаниеТиповЗаказПокупателя = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");		
	
	СписокЗаказов = Новый ТаблицаЗначений;		
	СписокЗаказов.Колонки.Добавить("ЗаказПоставщика", ОписаниеТиповЗаказПоставщика);
	СписокЗаказов.Колонки.Добавить("Номенклатура", ОписаниеТиповНоменклатура);
	СписокЗаказов.Колонки.Добавить("Количество", ОписаниеТиповЧисло);
	СписокЗаказов.Колонки.Добавить("КоличествоПоЗаказу", ОписаниеТиповЧисло);
	СписокЗаказов.Колонки.Добавить("Статус", ОписаниеТиповСтрока);
	СписокЗаказов.Колонки.Добавить("КодСтроки", ОписаниеТиповЧисло);
	СписокЗаказов.Колонки.Добавить("ЗаказПокупателя", ОписаниеТиповЗаказПокупателя);
	СписокЗаказов.Колонки.Добавить("ПлановаяДатаПоступления", ОписаниеТиповДата);
	СписокЗаказов.Колонки.Добавить("Назначение", ОписаниеТиповСтрока); 
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаКонец) Тогда
		
		//+Гавриленков В. 22.08.2025 #UT10-5394  
		КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней для получения статусов заказов");
		ДатаНТ = НачалоДня(ТекущаяДата()) - (?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 9) * 24 * 60 * 60);
		//ДатаНТ = НачалоДня(ТекущаяДата()) - 9*24*60*60;
		//-Гавриленков В. 22.08.2025 #UT10-5394
		ДатаКТ = КонецДня(ТекущаяДата());
		
	Иначе
		
		ДатаНТ = НачалоДня(ДатаНачала);
		ДатаКТ = КонецДня(ДатаКонец);
		
	КонецЕсли;
	
	Результат = МСКWEB.ПолучитьСтатусыИзСтороннейБазы(ДатаНТ, ДатаКТ, УТ11, ВидОперации,Склад); 
	
	//Обработка таблицы с ответом 
	Если НЕ Склад = Неопределено И ЗначениеЗаполнено(Склад.ДнейВПути) Тогда
		ДобавитьДнейКДатаПоступления = Склад.ДнейВПути;
	Иначе
		ДобавитьДнейКДатаПоступления = 0;	
	КонецЕсли; 

	Если Результат.Загружен Тогда
		
		СписокДанных = Результат.СписокДанных;
		
		Для Каждого Элем Из СписокДанных Цикл
			
			НовСтрока = СписокЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Элем);

			Если УТ11 Тогда
				
				НовСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Элем.Артикул);				
				НовСтрока.ЗаказПоставщика = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ГУИДЗаказаПокупателя", Элем.Заказ);
				
			Иначе
				
				НовСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Элем.Артикул); 
				НовСтрока.ЗаказПоставщика = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ГУИДЗаказаПокупателя", Элем.ЗаказПокупателя);
				
			КонецЕсли;

		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
			
	СписокОтмененыхЗаказовПоставщика = Новый ТаблицаЗначений;		
	СписокОтмененыхЗаказовПоставщика.Колонки.Добавить("ЗаказПоставщика", ОписаниеТиповЗаказПоставщика);
	СписокОтмененыхЗаказовПоставщика.Колонки.Добавить("Номенклатура", ОписаниеТиповНоменклатура);
	СписокОтмененыхЗаказовПоставщика.Колонки.Добавить("КодСтроки", ОписаниеТиповЧисло);
	СписокОтмененыхЗаказовПоставщика.Колонки.Добавить("Статус", ОписаниеТиповСтрока);
			
	ЗаказПоставщикаТекущий = Неопределено;
	ТзЗаказов = СписокЗаказов.Скопировать();
	ТзЗаказов.Очистить();
	
	//Установка кодов строк по фифо для пришедших статусов товаров и лифо для отказов
	Для Каждого СтрЗаказов Из СписокЗаказов Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрЗаказов.ЗаказПоставщика) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидОперации = "СторонниеСклады" И СтрЗаказов.ЗаказПоставщика.IDСклада.ОтправлятьЗаказыПоСкладуВУТ11 = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗаказПоставщикаТекущий <> СтрЗаказов.ЗаказПоставщика Тогда
			ЗаказПоставщикаТекущий = СтрЗаказов.ЗаказПоставщика;			
		КонецЕсли;
										
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура", СтрЗаказов.Номенклатура);		
		
		Если ЗначениеЗаполнено(СтрЗаказов.Назначение) Тогда
			
			ТекНазнач = СтрЗаменить(СокрЛП(СтрЗаказов.Назначение), "/", Символы.ПС);			
			НомерЗаказа = СтрПолучитьСтроку(ТекНазнач, 2);
			ДатаЗаказа = СтрЗаменить(СтрПолучитьСтроку(ТекНазнач, 3), ".", Символы.ПС);
			
			Попытка
				ДатаЗаказа = Дата(СтрПолучитьСтроку(ДатаЗаказа, 3) + СтрПолучитьСтроку(ДатаЗаказа, 2) + СтрПолучитьСтроку(ДатаЗаказа, 1));
			Исключение
				ДатаЗаказа = Дата(1,1,1);
			КонецПопытки;			
			
			ТекЗаказПокупателя = Документы.ЗаказПокупателя.НайтиПоНомеру(НомерЗаказа, ДатаЗаказа); 
			
			Если ЗначениеЗаполнено(ТекЗаказПокупателя) Тогда
				Отбор.Вставить("Заказ", ТекЗаказПокупателя);
			КонецЕсли;			
			
		КонецЕсли;		
		
		Рез = ЗаказПоставщикаТекущий.Товары.НайтиСтроки(Отбор);
		
		Сч = ?(СтрЗаказов.Статус <> "120; нет на складе", 0, Рез.Количество()-1);
		Граница = ?(СтрЗаказов.Статус <> "120; нет на складе", Рез.Количество(), -1);
		
		Пока Сч <> Граница Цикл 
			
			СтрРез = Рез[Сч];			
			КолвоРаспределить = СтрЗаказов.Количество; 
			КолвоПоСтроке = СтрРез.Количество;
			
			Если Не ЗначениеЗаполнено(СтрЗаказов.Назначение) И (ЗначениеЗаполнено(СтрРез.Заказ)
				И ТипЗнч(СтрРез.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И СтрРез.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала) Тогда
				
				Сч = ?(СтрЗаказов.Статус <> "120; нет на складе", Сч+1, Сч-1);
				Продолжить;
				
			КонецЕсли;			
			
			//Минусуем уже распределенное колво по статусу
			ОтборТаб = Новый Структура();
			ОтборТаб.Вставить("Номенклатура", СтрРез.Номенклатура);			
			ОтборТаб.Вставить("Статус", СтрЗаказов.Статус);
			ОтборТаб.Вставить("ЗаказПоставщика", СтрЗаказов.ЗаказПоставщика);
			ОтборТаб.Вставить("Назначение", СтрЗаказов.Назначение); 			
			
			СтрокиТаб = ТзЗаказов.НайтиСтроки(ОтборТаб);
			
			Для Каждого СтрТаб Из СтрокиТаб Цикл
				КолвоРаспределить = КолвоРаспределить - СтрТаб.Количество;				
			КонецЦикла;
			
			Если СтрЗаказов.Статус <> "120; нет на складе" Тогда
				
				//Минусуем уже распределенное колво по коду строки
				ОтборТаб = Новый Структура();
				ОтборТаб.Вставить("Номенклатура", СтрРез.Номенклатура);
				ОтборТаб.Вставить("КодСтроки" ,СтрРез.УИД);			
				ОтборТаб.Вставить("ЗаказПоставщика", СтрЗаказов.ЗаказПоставщика);
				СтрокиТаб = ТзЗаказов.НайтиСтроки(ОтборТаб);
				
				Для Каждого СтрТаб Из СтрокиТаб Цикл
					КолвоПоСтроке = КолвоПоСтроке - СтрТаб.Количество;				
				КонецЦикла;
				
			КонецЕсли;
			
			Если КолвоРаспределить <= 0 Или КолвоПоСтроке <= 0 Тогда
				
				Сч = ?(СтрЗаказов.Статус <> "120; нет на складе", Сч+1, Сч-1);
				Продолжить;
				
			КонецЕсли;
			
			НовСтр = ТзЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрЗаказов);
			НовСтр.КодСтроки = СтрРез.УИД;
			НовСтр.КоличествоПоЗаказу = СтрРез.Количество;
			НовСтр.ЗаказПокупателя = СтрРез.Заказ;
			НовСтр.Количество = Мин(КолвоРаспределить, КолвоПоСтроке, СтрРез.Количество);
									
			Сч = ?(СтрЗаказов.Статус <> "120; нет на складе", Сч+1, Сч-1);
			
		КонецЦикла;
								
	КонецЦикла;
	
	СписокЗаказов.Очистить();
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ЗаказПоставщика,
	               |	ТЗ.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ТЗ.Статус = ""120; нет на складе""
	               |			ТОГДА 0
	               |		ИНАЧЕ ТЗ.Количество
	               |	КОНЕЦ КАК Количество,
	               |	ТЗ.КоличествоПоЗаказу,
	               |	ТЗ.Статус,
	               |	ТЗ.КодСтроки,
	               |	ТЗ.ЗаказПокупателя,
	               |	ТЗ.ПлановаяДатаПоступления,
	               |	ТЗ.Назначение
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ЗаказПоставщика,
	               |	ВТ.Номенклатура,
	               |	ВТ.Количество,
	               |	ВТ.КоличествоПоЗаказу,
	               |	ВТ.Статус,
	               |	ВТ.КодСтроки,
	               |	ВТ.ЗаказПокупателя,
	               |	-1 * ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК КоличествоКорЗакПост,
	               |	ВТ.ПлановаяДатаПоступления,
	               |	ВТ.Назначение
	               |ПОМЕСТИТЬ ВТСписокЗП
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КорректировкаЗаказаПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
	               |			КорректировкаЗаказаПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |			СУММА(КорректировкаЗаказаПоставщикуТовары.Количество) КАК Количество
	               |		ИЗ
	               |			Документ.КорректировкаЗаказаПоставщику.Товары КАК КорректировкаЗаказаПоставщикуТовары
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаказаПоставщику КАК КорректировкаЗаказаПоставщику
	               |				ПО КорректировкаЗаказаПоставщикуТовары.Ссылка = КорректировкаЗаказаПоставщику.Ссылка
	               |		ГДЕ
	               |			КорректировкаЗаказаПоставщику.ПометкаУдаления = ЛОЖЬ
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КорректировкаЗаказаПоставщику.ЗаказПоставщику,
	               |			КорректировкаЗаказаПоставщикуТовары.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ВТ.ЗаказПоставщика = ВложенныйЗапрос.ЗаказПоставщику
	               |			И ВТ.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСписокЗП.ЗаказПоставщика КАК ЗП_ЗаказПоставщикуСсылка,
	               |	ВТСписокЗП.Номенклатура КАК ЗП_Товары_Номенклатура,
	               |	ВТСписокЗП.Количество КАК ВТ_Количество,
	               |	ВТСписокЗП.КоличествоПоЗаказу КАК ЗП_Товары_Количество,
	               |	ВТСписокЗП.Статус КАК ВТ_Статус,
	               |	ВТСписокЗП.КодСтроки КАК ВТ_КодСтроки,
	               |	ВТСписокЗП.ЗаказПокупателя КАК ЗП_Товары_ЗаказПокупателя,
	               |	ВТСписокЗП.КоличествоКорЗакПост,
	               |	ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ВТСписокЗП.ПлановаяДатаПоступления,
	               |	ВТСписокЗП.Назначение
	               |ИЗ
	               |	ВТСписокЗП КАК ВТСписокЗП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |				,
	               |				(ЗаказПоставщику, Номенклатура) В
	               |					(ВЫБРАТЬ
	               |						ВТСписокЗП.ЗаказПоставщика,
	               |						ВТСписокЗП.Номенклатура
	               |					ИЗ
	               |						ВТСписокЗП КАК ВТСписокЗП)) КАК ЗаказыПоставщикамОстатки
	               |		ПО ВТСписокЗП.ЗаказПоставщика = ЗаказыПоставщикамОстатки.ЗаказПоставщику
	               |			И ВТСписокЗП.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗП_ЗаказПоставщикуСсылка,
	               |	ЗП_Товары_Номенклатура";	
	
	Запрос.УстановитьПараметр("ТЗ", ТзЗаказов);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СтатусТЗ = СписокОтмененыхСтатусов();
	ЗаказаПоставщикаТекущий = Неопределено;
	НоменклатураТекущий = Неопределено;
	КодСтрокиТекущий = Неопределено;
	ОписаниеДокумента = "";
	
	СписокЗПДляКорректировкиДаты = Новый ТаблицаЗначений;		
	СписокЗПДляКорректировкиДаты.Колонки.Добавить("ЗаказПокупателя", ОписаниеТиповЗаказПокупателя);
	СписокЗПДляКорректировкиДаты.Колонки.Добавить("ПлановаяДатаПоступления", ОписаниеТиповДата);
	
	//Запись таблицы в регистр
	Пока РезультатЗапроса.Следующий() Цикл	
			
		Если ЗначениеЗаполнено(ОписаниеДокумента) Тогда
			
			ОшибкаЗагрузки("", "Невозможно создать документы. " + ОписаниеДокумента);				
			ОписаниеДокумента = "";
			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка) Или РезультатЗапроса.ВТ_КодСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		КорректировкаЗаказаПоставщика = Документы.КорректировкаЗаказаПоставщику.ПустаяСсылка();
		КорректировкаЗаказаПокупателя = Документы.КорректировкаЗаказаПокупателя.ПустаяСсылка();
		
		Если ЗаказаПоставщикаТекущий <> РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка Тогда
						
			НаборЗаписейИстория = РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов.СоздатьНаборЗаписей();
			// Очищаем определенный набор записей
			НаборЗаписейИстория.Отбор.Документ.Установить(РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка);			
			НаборЗаписейИстория.Прочитать();
			НаборЗаписейИстория.Очистить();												                  
			НаборЗаписейИстория.Записать(Истина);			
			
		КонецЕсли; 			
		
		Если ЗаказаПоставщикаТекущий <> РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка ИЛИ
			НоменклатураТекущий <>  РезультатЗапроса.ЗП_Товары_Номенклатура Тогда
			
			ЗаказаПоставщикаТекущий = РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка;
			НоменклатураТекущий = РезультатЗапроса.ЗП_Товары_Номенклатура;

		КонецЕсли; 
		
		МенеджерЗаписейИстория = РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписейИстория.Документ     = РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка;
		МенеджерЗаписейИстория.Номенклатура = РезультатЗапроса.ЗП_Товары_Номенклатура;
		МенеджерЗаписейИстория.КодСтроки 	= РезультатЗапроса.ВТ_КодСтроки;
		МенеджерЗаписейИстория.Статус 		= РезультатЗапроса.ВТ_Статус;
		
		МенеджерЗаписейИстория.КоличествоAvarda 		     = РезультатЗапроса.ВТ_Количество;
		МенеджерЗаписейИстория.КоличествоЗаказПоставщика     = РезультатЗапроса.ЗП_Товары_Количество;
		МенеджерЗаписейИстория.КоличествоКорЗаказаПоставщика = РезультатЗапроса.КоличествоКорЗакПост;
		МенеджерЗаписейИстория.КоличествоОстатокПоСкладу     = РезультатЗапроса.КоличествоОстаток;
		МенеджерЗаписейИстория.ЗаказПокупателя               = РезультатЗапроса.ЗП_Товары_ЗаказПокупателя;
		МенеджерЗаписейИстория.ДатаЗагрузки					 = ТекущаяДата();		
		МенеджерЗаписейИстория.Назначение					 = РезультатЗапроса.Назначение; 
		
		МенеджерЗаписейИстория.ПлановаяДатаПоступленияНаСкладФилиала = РезультатЗапроса.ПлановаяДатаПоступления;		
		
		Если ЗначениеЗаполнено(РезультатЗапроса.ПлановаяДатаПоступления) И ЗначениеЗаполнено(РезультатЗапроса.ЗП_Товары_ЗаказПокупателя) Тогда

			ПромДатаЗаказа = РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузки;  
			
			//+Гавриленков В. 18.03.2026 #UT10-5773
			////+Гавриленков В. 11.06.2025 #UT10-5279
			////ПромДатаЗаказаСПортала = ?(ЗначениеЗаполнено(РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузкиСПортала), 
			////                     РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузкиСПортала,
			////					 РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузки); 
			////-Гавриленков В. 11.06.2025 #UT10-5279

			//Если НЕ Склад = Неопределено Тогда
			//	
			//	Если НЕ ДобавитьДнейКДатаПоступления = 0 Тогда
			//		ПромДатаДоставки = НачалоДня(РезультатЗапроса.ПлановаяДатаПоступления) + 86400*ДобавитьДнейКДатаПоступления; 
			//	Иначе
			//		ПромДатаДоставки = Дата(1,1,1);
			//	КонецЕсли;
			//	
			//Иначе
			//	ПромДатаДоставки = РезультатЗапроса.ПлановаяДатаПоступления;   
			//КонецЕсли;   
			//
			////+Гавриленков В. 11.06.2025 #UT10-5279
			////Если НачалоДня(ПромДатаДоставки) >= НачалоДня(ПромДатаЗаказаСПортала) Тогда  
			////	
			////	ПредполагаемаяДатаОтгрузки = НачалоДня(ПромДатаДоставки) + 3600; 
			////	
			////	Если ПредполагаемаяДатаОтгрузки = ПромДатаЗаказа Тогда					
			////		ПромДатаДоставки = Дата(1,1,1); 
			////	Иначе
			////		ПромДатаДоставки = ПредполагаемаяДатаОтгрузки;
			////	КонецЕсли;
			////	
			////Иначе  						

			////	Если ЗначениеЗаполнено(РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.IDСклада_СтороннийСклад) Тогда 
			////		
			////		Если ПромДатаЗаказа > ПромДатаЗаказаСПортала Тогда
			////			ПромДатаДоставки = ПромДатаЗаказаСПортала;
			////		КонецЕсли;					
			////		
			////	Иначе
			////		ПромДатаДоставки = Дата(1,1,1);	
			////	КонецЕсли;

			////КонецЕсли; 
			//			
			//Если НачалоДня(ПромДатаДоставки) > НачалоДня(ПромДатаЗаказа) Тогда 				
			//	ПромДатаДоставки = НачалоДня(ПромДатаДоставки) + 3600;
			//Иначе
			//	ПромДатаДоставки = Дата(1,1,1);
			//КонецЕсли; 
			////-Гавриленков В. 11.06.2025 #UT10-5279 
			
			ПромДатаЗаказаСПортала = ?(ЗначениеЗаполнено(РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузкиСПортала), 
			                     РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузкиСПортала,
								 РезультатЗапроса.ЗП_Товары_ЗаказПокупателя.ДатаОтгрузки); 

			Если НЕ Склад = Неопределено Тогда
				
				Если НЕ ДобавитьДнейКДатаПоступления = 0 Тогда
					ПромДатаДоставки = НачалоДня(РезультатЗапроса.ПлановаяДатаПоступления) + 86400*ДобавитьДнейКДатаПоступления; 
				Иначе
					ПромДатаДоставки = Дата(1,1,1);
				КонецЕсли;
				
			Иначе
				ПромДатаДоставки = РезультатЗапроса.ПлановаяДатаПоступления;   
			КонецЕсли;   
			
			Если НачалоДня(ПромДатаДоставки) >= НачалоДня(ПромДатаЗаказаСПортала) Тогда  
				
				//+Гавриленков В. 08.05.2026 #UT10-5849
				//ПредполагаемаяДатаОтгрузки = НачалоДня(ПромДатаДоставки) + 3600;
				ПредполагаемаяДатаОтгрузки = Макс(НачалоДня(ПромДатаДоставки) + 3600, ПромДатаЗаказаСПортала);
				//-Гавриленков В. 08.05.2026 #UT10-5849
				
				Если ПредполагаемаяДатаОтгрузки = ПромДатаЗаказа Тогда					
					ПромДатаДоставки = Дата(1,1,1); 
				Иначе
					ПромДатаДоставки = ПредполагаемаяДатаОтгрузки;
				КонецЕсли;
				
			Иначе  						
					
				Если ПромДатаЗаказа = ПромДатаЗаказаСПортала Тогда
					ПромДатаДоставки = Дата(1,1,1);
				Иначе
					ПромДатаДоставки = ПромДатаЗаказаСПортала;
				КонецЕсли;					
					
			КонецЕсли;  
			//-Гавриленков В. 18.03.2026 #UT10-5773
			
			Если НЕ ПромДатаДоставки = Дата(1,1,1) Тогда 
				
				СтрЗаказа = СписокЗПДляКорректировкиДаты.Добавить();
				СтрЗаказа.ЗаказПокупателя = РезультатЗапроса.ЗП_Товары_ЗаказПокупателя; 
				СтрЗаказа.ПлановаяДатаПоступления = ПромДатаДоставки;
				
			КонецЕсли;
			
		КонецЕсли;

		// Создаем корректировку ЗаказаПоставщика, корректировку заказа покупателя.
		Если СтатусТЗ.Найти(РезультатЗапроса.ВТ_Статус, "Имя") <> Неопределено  Тогда
			
			Если (РезультатЗапроса.КоличествоОстаток = 0) Или (РезультатЗапроса.ВТ_Статус = "120; нет на складе") Тогда
				
				МенеджерЗаписейИстория.Записать();					
				
				Если РезультатЗапроса.ВТ_Статус = "120; нет на складе" Тогда
					ЗаполнитьСписокОтмененыхЗаказовПоставщика(РезультатЗапроса, "120; нет на складе");	
				КонецЕсли; 
				
				Продолжить;					
				
			КонецЕсли; 
			
			Если РезультатЗапроса.КоличествоКорЗакПост < РезультатЗапроса.ВТ_Количество И РезультатЗапроса.ВТ_Количество > 0  Тогда					
				
				КоличествоКорректировки = РезультатЗапроса.ВТ_Количество - РезультатЗапроса.КоличествоКорЗакПост;
				
				МассивОшибок = Новый Массив;
				
				МассивОшибок.Добавить("Заказ поставщика:" +РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка.Номер + " "  + Строка(РезультатЗапроса.ЗП_ЗаказПоставщикуСсылка.Дата) + " ; ");
				МассивОшибок.Добавить("Номенклатура: " + РезультатЗапроса.ЗП_Товары_Номенклатура.Код + " " + РезультатЗапроса.ЗП_Товары_Номенклатура.Наименование + " ; ");
				МассивОшибок.Добавить("Код строки: " + РезультатЗапроса.ВТ_КодСтроки + " ; ");
				МассивОшибок.Добавить("Статус: " + РезультатЗапроса.ВТ_Статус + " ; ");
				
				МенеджерЗаписейИстория.Записать();												
				
				Попытка
					//////
					//НачатьТранзакцию();																		
					
					СоздатьКорректировкуЗаказаПоставщика(РезультатЗапроса, КоличествоКорректировки);																		
					
					//ЗафиксироватьТранзакцию();										
					
					МенеджерЗаписейИстория.КоличествоДопКорЗаказаПоставщика = КоличествоКорректировки;												
					МенеджерЗаписейИстория.КорректировкаЗаказаПоставщика = КорректировкаЗаказаПоставщика;
					МенеджерЗаписейИстория.КорректировкаЗаказаПокупателя = КорректировкаЗаказаПокупателя;						
					МенеджерЗаписейИстория.Записать();												
					
					Продолжить;
					
				Исключение
					
					//ОтменитьТранзакцию();	
					ОписаниеДокумента = ОписаниеОшибкиОбработкиДанных(МассивОшибок);
					Ошибка = ИнформацияОбОшибке();
					ОписаниеДокумента = ОписаниеДокумента + "; " + Ошибка.Причина.Описание; 
					Продолжить;
					
				КонецПопытки; 
				
			КонецЕсли; 	
			
		Иначе
			
			МенеджерЗаписейИстория.Записать();
			Продолжить;
			
		КонецЕсли; 
		
	КонецЦикла;					
	                                                
	ОбработатьСтатус120НетНаскладе(СтатусТЗ);
	
	Если НЕ СписокЗПДляКорректировкиДаты.Количество() = 0 Тогда
		КорректировкаДатыОтгрузкиВЗаказахПокупателя(СписокЗПДляКорректировкиДаты); 	
	КонецЕсли;    

КонецПроцедуры

Процедура КорректировкаДатыОтгрузкиВЗаказахПокупателя(СписокЗПДляКорректировкиДаты)

	Если СписокЗПДляКорректировкиДаты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	СписокЗПДляКорректировкиДаты.Свернуть("ЗаказПокупателя, ПлановаяДатаПоступления");
	СписокЗПДляКорректировкиДаты.Сортировать("ЗаказПокупателя, ПлановаяДатаПоступления");
	
	Для Каждого СтрСписка Из СписокЗПДляКорректировкиДаты Цикл		 
		
		ТекЗаказ = СтрСписка.ЗаказПокупателя;
		ЗаказПоставщикуОбъект = ТекЗаказ.ПолучитьОбъект();			
		ЗаказПоставщикуОбъект.ДатаОтгрузки = СтрСписка.ПлановаяДатаПоступления; 
		ЗаказПоставщикуОбъект.Записать(РежимЗаписиДокумента.Проведение);			

	КонецЦикла;	

КонецПроцедуры

Функция ПроверитьРезерв(ЗаказПокупателя)

	Ответ = Новый Структура("ЕстьРезерв", Ложь);
	Ответ.Вставить("ДатаОтгрузки", Дата(1,1,1));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	СУММА(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстатокПоРезерву
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстатокПоРезерву.ДокументРезерва,
	|	СУММА(ОстатокПоРезерву.КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(ТоварыВРезервеНаСкладах.Период) КАК Период
	|ИЗ
	|	ОстатокПоРезерву КАК ОстатокПоРезерву
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	|		ПО ОстатокПоРезерву.ДокументРезерва = ТоварыВРезервеНаСкладах.ДокументРезерва
	|			И (ТоварыВРезервеНаСкладах.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстатокПоРезерву.ДокументРезерва");
	
	Запрос.Параметры.Вставить("ДокументРезерва", ЗаказПокупателя);
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Выборка = РезЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Ответ.ЕстьРезерв = Истина;
		Ответ.ДатаОтгрузки = Выборка.Период; 	
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции
